var _subWayLines = [{ Name: '一号线（余杭）', Coords: '95231,23918,94966,24090,94594,24305,93940,24683,93484,24948,93272,25057,92132,25538,91761,25696,91151,25978,90558,26231,90136,26310,89675,26384,89134,26458,88422,26647,87868,26827,87466,27018,87272,27135,86573,27549,86493,27602,86447,27641,86369,27746,86116,28449,86083,28536,86029,28613,85946,28706,85865,28753,85484,28846,85360,28890,84812,29061,84579,29121,84321,29184,84147,29223,83960,29253,83670,29302,83471,29330,83284,29360,83122,29396,82963,29445,82708,29533,82255,29704,81865,29856,81126,30141,80762,30282,80640,30323,80548,30351,80455,30367,80332,30386,80040,30403,79449,30431,78306,30480,77472,30526,77072,30592,76340,30726,75784,30866,75317,31011,75042,31108,74738,31238,74510,31350,74219,31532,73986,31652,73592,31862,73408,31959,73293,32043,73173,32157,72986,32359,72918,32508,72711,32863,72589,33048,72511,33207,72520,33359,72542,33738,72560,33890,72547,34066,72509,34219,72444,34381,72345,34521,72239,34638,72088,34781,71743,35064,71588,35193,71443,35284,71241,35402,71031,35504,70270,35848,66514,37501,65940,37742,65542,37874,65152,37962,64892,37972,63755,37799,63471,37709,63097,37535,62798,37352,61777,36685' }, { Name: '一号线', Coords: '81701,57732,85910,55041,86766,54527,87691,53886,88007,53653,88046,53550,87985,53422,87349,53015,84762,51331,84460,51178,82938,50283,82279,49904,80961,49189,79306,48240,78208,47630,77375,47182,76856,46860,75150,45765,74336,45269,73531,44787,72319,44037,71814,43699,71504,43443,70876,42941,70348,42522,70110,42316,69892,42088,69690,41878,69534,41769,68819,41366,68534,41249,67956,40990,67646,40840,67152,40574,66796,40377,66572,40245,65040,39087,64500,38573,63957,38151,63584,37892,62798,37352,61246,36342,61128,36305,60962,36284,59741,36190,59304,36128,58869,35998,58612,35869,57560,35188,56931,34762,56741,34662,56328,34486,55509,34170,55266,34098,54524,33895,53274,33580,51578,33193,50468,32973,46971,32228,46026,32065,45553,31983,45114,31895,44825,31781,43141,30971,42025,30437,41690,30304,41340,30193,41077,30133,39115,29889,38312,29796,37881,29704,37566,29586,35762,28779,35251,28576,34674,28364,33679,28066,32749,27792,32596,27738,32345,27633,30967,26992,29404,26241,28209,25626,26540,24757,26104,24544,25671,24356,25491,24292,25359,24262,25222,24248,25105,24257,25016,24285,24899,24352,24777,24464,24234,24829,23930,25028,23653,25166,23043,25338,22846,25369,22717,25418,22481,25511,22162,25628,21914,25736,21699,25836,21412,25979,21031,26202,19476,27288,18731,27819,17359,28757,16371,29467,15537,30058,15421,30166,15374,30249,15396,30311,15511,30416,15879,30656,16451,31009,16574,31091,16830,31267,17985,32079,18299,32302,18604,32511,18743,32625,18823,32705,18886,32811,19248,33577,19323,33785,19310,34018,19333,34510,19411,35062,19497,35828,19450,36475,19469,37320,19478,37784,19468,38018,19495,38654,19609,39553,19580,39856,19105,41727,18892,42385,18840,42746,18783,43063,18695,44097,18639,44549,18595,44743,18539,44895,18437,45037,18163,45268,16938,46204,16064,46894,15411,47423,14462,48122,14237,48281,13393,48798,13251,48909,13180,49046,13156,49242,13274,49978,13318,50126,13386,50285,13491,50447,13754,50749,14617,51501,14764,51651,14807,51729,14852,51830,14875,51904,14927,52328,14940,52599,14915,52740,14876,52856,14789,52946,14580,53089,13270,53925,12911,54149,12539,54420,12372,54563,12018,54909,11710,55165,11235,55515,10842,55791,10704,55890,10479,56049,10274,56192,10041,56356,9862,56496' }, { Name: '二号线', Coords: '6533,69394,7694,68597,10127,66901,10776,66464,11027,66298,11421,66101,11728,65969,12092,65717,12737,65244,12915,65117,13530,64756,13896,64532,14277,64303,14592,64099,14838,63900,15416,63495,16233,62962,17379,62205,18504,61435,19014,61053,19423,60699,19678,60517,19949,60330,20831,59749,21420,59425,21801,59196,22225,58922,23570,58081,23893,57859,24994,56903,25467,56528,25569,56454,25702,56377,25904,56268,26097,56169,26415,56015,27220,55642,28378,55137,29424,54633,29768,54470,30524,54104,32346,53230,32816,53004,33004,52904,33119,52826,33349,52643,33613,52419,34827,51432,35619,50835,35959,50545,36168,50334,36311,50079,36407,49766,36401,49564,36346,49274,36277,49100,35957,48233,35543,47129,35187,46279,34970,45826,34862,45577,34762,45434,34635,45240,34487,45028,34301,44717,33788,43544,33516,43002,33175,42216,32989,41862,31261,38760,31169,38545,30894,37830,30494,36846,30380,36526,30318,36388,30215,36126,30095,35853'}];
var _subWayStations = { '一号线（余杭）': [{ X: 91413, Y: 25859, Name: '南苑站' }, { X: 86811, Y: 27413, Name: '余杭高铁站' }, { X: 73849, Y: 31727, Name: '乔司站' }, { X: 81359, Y: 30054, Name: '临平南站' }, { X: 69816, Y: 36048, Name: '乔司南站'}], '一号线': [{ X: 86847, Y: 52694, Name: '下沙高教园东站' }, { X: 85846, Y: 55087, Name: '云水站' }, { X: 81742, Y: 57711, Name: '下沙临江站' }, { X: 79950, Y: 48613, Name: '下沙高教园西站' }, { X: 73594, Y: 44827, Name: '下沙站' }, { X: 76468, Y: 46615, Name: '下沙东站' }, { X: 70519, Y: 42660, Name: '下沙西站' }, { X: 62175, Y: 36947, Name: '客运中心站' }, { X: 54384, Y: 33860, Name: '九和路站' }, { X: 58270, Y: 35649, Name: '九堡站' }, { X: 44025, Y: 31400, Name: '彭埠站' }, { X: 49472, Y: 32763, Name: '七堡站' }, { X: 40491, Y: 30062, Name: '火车东站站' }, { X: 28863, Y: 25966, Name: '打铁关站' }, { X: 33073, Y: 27888, Name: '闸弄口站' }, { X: 22462, Y: 25518, Name: '武林广场站' }, { X: 24788, Y: 24451, Name: '西湖文化广场站' }, { X: 17555, Y: 28621, Name: '龙翔桥站' }, { X: 19826, Y: 27045, Name: '凤起路站' }, { X: 19033, Y: 33121, Name: '城站站' }, { X: 16127, Y: 30810, Name: '定安路站' }, { X: 19474, Y: 38217, Name: '富春路站' }, { X: 19470, Y: 36190, Name: '婺江路站' }, { X: 18226, Y: 45216, Name: '江陵路站' }, { X: 13238, Y: 49753, Name: '西兴站' }, { X: 15634, Y: 47239, Name: '滨河路站' }, { X: 10972, Y: 55700, Name: '湘湖站' }, { X: 14899, Y: 52097, Name: '滨康路站'}], '二号线': [{ X: 30265, Y: 36255, Name: '钱江路站' }, { X: 34015, Y: 44066, Name: '钱江世纪城站' }, { X: 36132, Y: 48713, Name: '外环路站' }, { X: 35111, Y: 46120, Name: '内环路站' }, { X: 33624, Y: 52411, Name: '振宁路站' }, { X: 30012, Y: 54352, Name: '建设三路站' }, { X: 26654, Y: 55906, Name: '建设一路站' }, { X: 22650, Y: 58655, Name: '人民广场站' }, { X: 20278, Y: 60112, Name: '杭发厂站' }, { X: 17587, Y: 62066, Name: '人民路站' }, { X: 14366, Y: 64247, Name: '潘水路站' }, { X: 10420, Y: 66703, Name: '南部卧城站'}] };

window.onload = fnOnload;


function fnOnload() {
    if (!window.Config) {
        setTimeout('fnOnload()', 200);
        return;
    }
    fnSubWayList();

    //广告
    var script = this.$C('script');
    script.type = 'text/javascript';
    script.language = 'javascript';
    script.src = window.Config.DataCetnerAdDataUrl + 'Ad2.0/ads.aspx?citycode=' + window.Config.CityCode + '&l=' + window.Config.Language + '&key=gongjiaoliebiao&domid=div_ad';
    document.getElementsByTagName('head')[0].appendChild(script);
}

function fnSubWayList() {
    var s='';
    if (_subWayLines.length > 0) {
        for (var i = 0; i < _subWayLines.length; i++) {
            s += string.Format("<div style=\" width: 270px;\"><div class=\"bus_zhan_top\"></div><div class=\"bus_zhan_mid\"><h2><div style=\"cursor:pointer;\" class=\"bus_zhan_title\" onclick = \"javaccript:fnShowLi({0});\">{1}<div><a><img id=\"{2}\" src=\"../images/bus_ico3_1.gif\" border=\"0\"></a></div></div></h2><div id=\"{3}\" style=\"display:none;\"><ul class=\"bus_zhan_con\">{$liLine}</ul></div></div><div class=\"bus_zhan_down\"></div></div>", i, _subWayLines[i].Name, "img" + i, "stationdiv" + i);
            
            var stationCount = _subWayStations[_subWayLines[i].Name].length;
            var stionNameList = _subWayStations[_subWayLines[i].Name];
            var ss = '';
            for (var l = 0; l < stationCount; l++) {
                ss += string.Format("<li><a href=\"javascript:parent.MoveTo({0},{1});\">{2}</a>&nbsp;&nbsp;</li>", stionNameList[l].X, stionNameList[l].Y, stionNameList[l].Name); 
            }
            s = s.replace('{$liLine}', ss);
        }
        var sSubway = '<h1>共有<b>{$No}</b>条地铁线路</h1>';
        $('TabContent').innerHTML = sSubway.replace('{$No}', _subWayLines.length) + s;
    }
    fnResize();
}

function fnShowLi(index) {
    if ($('stationdiv' + index).style.display == 'none') {
        $('stationdiv' + index).style.display = 'block';
        $('img' + index).src = '../images/bus_ico3.gif';
        DrawCoordsLine(index);
    } else {
        $('stationdiv' + index).style.display = 'none';
        $('img' + index).src = '../images/bus_ico3_1.gif';
        parent._SubWayLayer.innerHTML = '';
        parent._SubWayStationLayer.innerHTML = '';
        parent.__SubwayCoords = '';
    }
    
}

function DrawCoordsLine(index) {
    parent._SubWayLayer.innerHTML = '';
    parent._SubWayStationLayer.innerHTML = '';

    var _tempArr = _subWayStations[_subWayLines[index].Name];
    for (var k = 0; k < _tempArr.length; k++) {
        var _subWayList = _tempArr[k].Name;
        var _x = _tempArr[k].X;
        var _y = _tempArr[k].Y;

        var vlen = _subWayList.length * 12.1;
        var nd = parent.vM.$C('div');
        nd.id = 's_pop' + k;
        nd.innerHTML = string.Format("<span style=\"cursor:pointer; height:26px; float:left; font-size:12px; color:#000;white-space:nowrap;{0}\"><span style=\"cursor:pointer; width:24px; height:24px; float:left; background:url(/Images/gongjiao.gif) no-repeat; text-align:center; padding-top:2px; color:white;\">{1}</span><span style=\"cursor:pointer; height:19px;line-height:19px; background:#fff; padding-right:4px; float:left;{2};\" onclick=\"parent.fnShowBusLinePop({3},{4})\">{5}</span></span>", 'width:' + (vlen + 40) + 'px', (k + 1), 'width:' + (vlen + 10) + 'px', _x, _y, _subWayList);
        parent.vM.AppendEntity(nd, parent._SubWayStationLayer, false, _x, _y, vlen + 35, 26, 12, 28, false);
    }

    parent.vM.DrawPolyLine(parent._SubWayLayer, parent._subWayLines[index].Coords, 4, '#ff3300', 0.7);
    parent.__SubwayCoords = _subWayLines[index].Coords;
}

function fnExit() {
    parent._SubWayLayer.innerHTML = '';
    parent._SubWayStationLayer.innerHTML = '';
    parent.__SubwayCoords = '';
}

//初始化高度
function fnResize(h) {
    if (!h) {
        $('TabContent').style.height = (fnGetWindowHeight() - 85) + 'px';
    }
    else {
        $('TabContent').style.height = (h - 85) + 'px';
    }
}

function fnActive() {
    fnResize();
}